import Header from "../../components/Header";

import React from 'react';

import "./index.css"

const PrivacyPolicy: React.FC = () => {
  const isScrolled = true;


  return (
    <>
      <Header isScrolled={isScrolled}/>
      <div className="privacy-policy">
        <h1>Политика конфиденциальности</h1>

        <ul>
          <li>
            Наша Политика конфиденциальности объясняет, как мы собираем, используем, передаем и защищаем информацию в
            рамках наших мобильных услуг, веб-сайта и любого программного обеспечения, предоставляемого в связи с
            услугами Seerah.kz (совместно именуемые "<strong>Сервис</strong>"), а также ваши возможности в отношении
            сбора и использования вашей информации.
          </li>
          <li>
            <strong>Общие положения</strong>
            <ul>
              <li>Настоящая Политика конфиденциальности распространяется на всю информацию, включая персональные данные,
                которую Seerah.kz (далее — "Мы") может получить о пользователях при использовании любых наших услуг
                ("Сервисы").
              </li>
              <li>Мы обрабатываем персональные данные в соответствии с законодательством Республики Казахстан о
                персональных данных и их защите.
              </li>
              <li>Для использования наших Сервисов не требуется регистрация, однако мы можем собирать определённую
                информацию, такую как данные о геолокации, для обеспечения корректной работы функционала.
              </li>
              <li>Нашей главной задачей является уважение прав и свобод пользователей при обработке их данных, включая
                защиту конфиденциальности.
              </li>
            </ul>
          </li>
          <li>
            <strong>Информация, которую мы собираем</strong>
            <ul>
              <li>Мы можем собирать следующие данные:</li>
              <ul>
                <li>Данные о геолокации для предоставления актуального контента в зависимости от местоположения
                  пользователя.
                </li>
                <li>Автоматически сгенерированный <strong>user_id</strong> для уникальной идентификации пользователей
                  без необходимости регистрации.
                </li>
              </ul>
              <li>Мы не предоставляем услуги лицам младше 18 лет и не собираем осознанно их данные.</li>
            </ul>
          </li>
          <li>
            <strong>Использование и защита информации</strong>
            <ul>
              <li>Мы используем информацию для обеспечения правильной работы Сервисов, улучшения их качества, а также
                для предоставления контента на основе местоположения пользователя.
              </li>
              <li>Мы предпринимаем разумные меры для защиты данных от потери, несанкционированного доступа и
                раскрытия.
              </li>
            </ul>
          </li>
          <li>
            <strong>Файлы cookie и мобильные идентификаторы</strong>
            <ul>
              <li>Мы можем использовать файлы cookie и мобильные идентификаторы для улучшения пользовательского опыта и
                персонализации Сервисов.
              </li>
            </ul>
          </li>
          <li>
            <strong>Права пользователей</strong>
            <ul>
              <li>Пользователи имеют право:</li>
              <ul>
                <li>Знать, какие персональные данные собираются и обрабатываются.</li>
                <li>Отозвать своё согласие на обработку данных.</li>
                <li>Требовать удаления или изменения своих данных.</li>
              </ul>
            </ul>
          </li>
          <li>
            <strong>Передача данных</strong>
            <ul>
              <li>Мы не передаем собранные данные третьим лицам, за исключением случаев, когда это необходимо для
                выполнения обязательств по предоставлению Сервисов или в соответствии с требованиями законодательства.
              </li>
            </ul>
          </li>
          <li>
            <strong>Изменения в Политике</strong>
            <ul>
              <li>Мы оставляем за собой право вносить изменения в данную Политику в одностороннем порядке. Изменения
                вступают в силу с момента их публикации на сайте.
              </li>
              <li>Пользователь самостоятельно несет ответственность за ознакомление с актуальной версией Политики.</li>
            </ul>
          </li>
          <li>
            <strong>Контактная информация</strong>
            <ul>
              <li>Если у вас есть вопросы, связанные с данной Политикой или обработкой персональных данных, вы можете
                связаться с нами по электронной почте: <strong>developer@seerah.kz</strong>.
              </li>
            </ul>
          </li>
        </ul>
      </div>
    </>
  );
};

export default PrivacyPolicy;
